In [1]:
import pandas as pd

In [3]:
data_largo = {
    'Producto': ['A', 'B', 'C', 'A', 'B', 'C'],
    'Mes': ['Enero', 'Enero', 'Enero', 'Febrero', 'Febrero', 'Febrero'],
    'Ventas': [100, 150, 200, 120, 160, 210]
}

df = pd.DataFrame(data_largo)
display(df)

  Producto      Mes  Ventas
0        A    Enero     100
1        B    Enero     150
2        C    Enero     200
3        A  Febrero     120
4        B  Febrero     160
5        C  Febrero     210

In [ ]:
#vamos a formatear que cada mes sea una columna y cada producto una fila. formato acho 
df_pivot = df.pivot(index='Producto', columns='Mes', values='Ventas')
display(df_pivot)

Mes       Enero  Febrero
Producto
A           100      120
B           150      160
C           200      210

In [ ]:
#Pivotear de nuevo a formato largo sirve para funciones de agregacion
df_pivot = df.pivot_table(index='Producto', columns='Mes', values='Ventas')
display(df_pivot)

Mes       Enero  Febrero
Producto
A         100.0    120.0
B         150.0    160.0
C         200.0    210.0